{
	"questions": [
		{
			"category": "my_wellbeing",
			"question_text": "Is there anything either inside or outside of work that may affect your wellbeing, that you think we should know about?",
			"order": 1,
			"preview": "External Wellbeing Factors"
		},
		{
			"category": "my_wellbeing",
			"question_text": "Please describe how you are when you are having a good day.",
			"order": 2,
			"preview": "On a Good Day"
		},
		{
			"category": "my_wellbeing",
			"question_text": "Please describe how you are when you are having a bad, or not-so-good day. Sometimes people mask what's really going on for them, so this may be things not visible to others.",
			"order": 3,
			"preview": "On a Bad Day"
		},
		{
			"category": "my_wellbeing",
			"question_text": "If things are not going so well, are you aware of any early warning signs that would be useful for us to learn? What action can we take when we recognise your early warning signs? Please include how you would like us to approach and raise this with you, along with what we can and cannot do to help or support you.",
			"order": 4,
			"preview": "Early Warning Signals"
		},
		{
			"category": "my_wellbeing",
			"question_text": "The following symptoms are indications that I am not well enough to be at work",
			"order": 5,
			"preview": "Symptoms I Experience"
		},
		{
			"category": "my_responsibilities",
			"question_text": "Do you have any parental or caring responsibilities that you think it would be helpful for us to know about?",
			"order": 6,
			"preview": "My Parental & Caring Responsibilities"
		},
		{
			"category": "my_responsibilities",
			"question_text": "What arrangements or support do you need from us to fulfil your role as parent or carer? This may include looking after your own wellbeing as well as that of the person you are a parent or carer for.",
			"order": 7,
			"preview": "Supporting My Parental & Caring Responsibilities"
		},
		{
			"category": "my_religion",
			"question_text": "Are there any arrangements or support you need from us which will enable you to take part in any religious practices? This may include space to pray or holidays you observe.",
			"order": 8,
			"preview": "My Religious Practices"
		},
		{
			"category": "my_religion",
			"question_text": "Is there anything else you think would be helpful for us to know about your religion or belief? This may include dietary needs for work events.",
			"order": 9,
			"preview": "Other Religious Requirements"
		},
		{
			"category": "my_conditions",
			"question_text": "Use this space to give a brief description of the impact your disability or long-term condition may have at work. You may need to split this up if you have multiple conditions.",
			"order": 10,
			"preview": "My Disability or Long-Term Condition"
		},
		{
			"category": "my_conditions",
			"question_text": "Are there any barriers which are impacting on your ability to perform in your job?",
			"order": 11,
			"preview": "Current Barriers"
		},
		{
			"category": "my_support_needs",
			"question_text": "Share the information about your work needs that would be helpful for your colleagues.",
			"order": 12,
			"preview": "What I Need"
		},
		{
			"category": "my_support_needs",
			"question_text": "What do you need to thrive in your role here at Islington? There is space in the next section to outline specific workplace adjustments.",
			"order": 13,
			"preview": "My Workplace Adjustments"
		},
		{
			"category": "about_me",
			"question_text": "Is there anything you think would be helpful for your colleagues to know? How should this be shared?",
			"order": 14,
			"preview": "Things to Know About Me"
		}
	]
}
