{
  "dashboard-no-profile": {
    "title": "Getting Started with Your Workplace Passport",
    "sections": [
      {
        "heading": "Welcome to Workwise",
        "text": "Your Digital Workplace Passport helps you document and share your workplace needs with your line manager, promoting a more inclusive work environment.",
        "screenshot": {
          "src": "/help/screenshots/dashboard-no-profile.png",
          "alt": "Dashboard showing profile selection dropdown",
          "caption": "Select your profile to get started"
        }
      },
      {
        "heading": "Getting Started",
        "text": "To begin using your workplace passport:",
        "callouts": [
          "Select your profile from the dropdown menu",
          "The dashboard is organized into three sections: Actions, Categories, and Resources",
          "Click on any category tile to start adding your responses",
          "Use the email button in the header to share your responses with your line manager",
          "Access help anytime by clicking the 'i' button in the footer"
        ]
      }
    ]
  },
  "dashboard-profile": {
    "title": "Your Workplace Passport Dashboard",
    "sections": [
      {
        "heading": "Dashboard Overview",
        "text": "Your dashboard is organized into three main sections: Actions (personal plans), Categories (workplace topics), and Resources (support materials). Each section contains tiles that allow you to navigate to specific areas.",
        "screenshot": {
          "src": "/help/screenshots/dashboard-with-profile.png",
          "alt": "Dashboard with three sections showing Actions, Categories, and Resources",
          "caption": "Dashboard showing Actions, Categories, and Resources sections"
        }
      },
      {
        "heading": "Using the Dashboard",
        "text": "Here's how to navigate your workplace passport:",
        "callouts": [
          "Actions section: View and manage your personal action items",
          "Categories section: Click category tiles to explore questions and add responses",
          "Resources section: Access helpful workplace support materials",
          "Use the email button in the header to share your public responses",
          "Click the 'i' button in the footer to access help anytime",
          "Adjust text size using the font control in the footer"
        ]
      },
      {
        "heading": "What's Next?",
        "text": "Start by exploring categories that are most relevant to your role and workplace needs. You can always come back to add more responses later."
      }
    ]
  },
  "actions": {
    "title": "Managing Your Actions",
    "sections": [
      {
        "heading": "About Actions",
        "text": "Actions are personal plans you create to help address workplace challenges. Each action is linked to a question from your workplace passport.",
        "screenshot": {
          "src": "/help/screenshots/actions-list.png",
          "alt": "Actions list showing action items with status toggles and link icons",
          "caption": "Your personal actions list with Active/Inactive toggles"
        }
      },
      {
        "heading": "Managing Actions",
        "text": "On this page you can:",
        "callouts": [
          "Toggle between Active and Inactive status for each action",
          "Click the link icon to view the related question",
          "Use 'Show inactive' toggle to see archived actions",
          "Set actions as public/private to control sharing"
        ]
      },
      {
        "heading": "Sharing",
        "text": "Public actions are included in emails to your line manager, helping them understand your proactive approach to workplace challenges."
      }
    ]
  },
  "resources": {
    "title": "Workplace Resources",
    "sections": [
      {
        "heading": "About Resources",
        "text": "Resources are helpful materials, links, and information related to workplace support and neurodivergent needs.",
        "screenshot": {
          "src": "/help/screenshots/resources-view.png",
          "alt": "Resources page showing available support materials with clickable links",
          "caption": "Browse available workplace support resources"
        }
      },
      {
        "heading": "What You'll Find Here",
        "text": "Resources can help you:",
        "callouts": [
          "Learn about workplace accommodations",
          "Find support materials for specific challenges",
          "Access external links and tools (click the URL to open in a new tab)",
          "Discover best practices for workplace inclusion",
          "Get guidance on communicating your needs"
        ]
      }
    ]
  },
  "categories": {
    "title": "Question Categories",
    "sections": [
      {
        "heading": "About Categories",
        "text": "Categories group related workplace topics and questions. Each question helps you document your workplace needs and preferences.",
        "screenshot": {
          "src": "/help/screenshots/categories-overview.png",
          "alt": "Category view showing available questions with status indicators",
          "caption": "Questions within a category - checkmark shows answered, question mark shows needs attention"
        }
      },
      {
        "heading": "Question Status",
        "text": "Understanding the indicators:",
        "callouts": [
          "Question mark (?) - Questions that need your attention",
          "Checkmark (✓) - Questions already answered or skipped",
          "Click any question to add or edit your response",
          "Set response visibility (public/private) for each answer"
        ]
      }
    ]
  },
  "responses": {
    "title": "Managing Your Response",
    "sections": [
      {
        "heading": "About Responses",
        "text": "Your responses document your workplace needs, preferences, and experiences. You have full control over what you share.",
        "screenshot": {
          "src": "/help/screenshots/response-editing.png",
          "alt": "Response editing interface showing privacy controls and action buttons",
          "caption": "Edit responses and control their visibility"
        }
      },
      {
        "heading": "Your Options",
        "text": "On this page you can:",
        "callouts": [
          "Provide a detailed response explaining your needs or preferences",
          "Mark the question as 'Not Applicable' if it doesn't apply to you",
          "Skip the question to answer it later",
          "Edit or update your response anytime",
          "Delete your response if you no longer want it saved",
          "Toggle between public and private visibility"
        ]
      },
      {
        "heading": "Privacy Control",
        "text": "You control the visibility:",
        "callouts": [
          "Public - Can be shared with your line manager via email",
          "Private - Remains confidential to you only",
          "Change the setting anytime using the toggle"
        ]
      },
      {
        "heading": "Creating Actions",
        "text": "Once you've answered this question, you can create personal action items:",
        "callouts": [
          "Actions help you address workplace challenges proactively",
          "Click 'Add Action' to create a plan linked to this question",
          "Edit or delete actions anytime",
          "Set actions as Active/Inactive to manage priorities",
          "Control action visibility (public/private)",
          "Public actions appear in emails to your line manager"
        ]
      }
    ]
  },
  "email": {
    "title": "Email Preview",
    "sections": [
      {
        "heading": "What You're Seeing",
        "text": "This preview shows a summary of your public responses and actions formatted as an email for your line manager.",
        "screenshot": {
          "src": "/help/screenshots/email-preview.png",
          "alt": "Email preview showing formatted workplace passport summary with send button",
          "caption": "Preview your workplace passport before sharing"
        }
      },
      {
        "heading": "Before Sending",
        "text": "Review the content carefully:",
        "callouts": [
          "Check that all information accurately represents your needs",
          "Verify only public responses and actions are included",
          "Use the notes field at the bottom for additional context (sparingly - the app tracks everything through questions, responses, and actions)",
          "Remember you control when and what to share"
        ]
      },
      {
        "heading": "Sending",
        "text": "When you're ready, enter your line manager's email address and click send. The email will be sent with a professional summary of your workplace passport."
      }
    ]
  }
}